Update docs after refactoring. Fix application entry point
